//Console.Write("Введите трехзначное число: ");
//int number = Convert.ToInt32(Console.ReadLine());
// 1 задача  Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

/*Console.Write("Введите первое число: ");
int number1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите второе число: ");
int number2 = Convert.ToInt32(Console.ReadLine());
if ( number1>number2){
    Console.WriteLine( $"число {number1} наибольшее" ) ;
    Console.WriteLine( $"число {number2} наименьшее" ) ;
   }
else {
    Console.WriteLine( $"число {number2} наибольшее" ) ;
    Console.WriteLine( $"число {number1} наименьшее" ) ;
}*/

//Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
/*Console.Write("Введите первое число: ");
  int number1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите второе число: ");
  int number2 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите третье  число: ");
  int number3 = Convert.ToInt32(Console.ReadLine());
int count = 0 ;
int max = number1 ;
while(count<2){
    if(max<number2){
        max = number2;
    }
    else if(max<number3){
        max= number3;
    }
    else{
        count++ ;
    }
}
Console.Write($"{max} - наибольшее из трех чисел ");*/

// 3 задача Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

/*Console.Write("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());
if (number%2==0){
  Console.Write($"число {number} является четным");
}
else{
  Console.Write($"число {number} является нечетным");
}*/
// задача 4Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

/*Console.Write("N= ");
int n = Convert.ToInt32(Console.ReadLine());
for(int i=1;i<=n;i++)
{
if (i % 2 == 0)
System.Console.Write(i + ",");
}*/